{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report describing branding updates and logo path changes referencing frontend/src/lib/brand.ts.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including entrypoint, styles, branding, and layout components.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Basic HTML shell that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack router with routes for core pages and wraps them in SiteLayout.",
  "frontend/src/components/InquiryForm.tsx": "Email inquiry form with mailto submission, clipboard copy, validation, and toast notifications.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand logo, quick links, contact info, and attribution using BRAND constants.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop nav, and mobile sheet menu using BRAND constants.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper providing header, footer, and a background pattern overlay.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future queries; contains no logic.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode overrides, global typography, and custom utility classes for gradients and glow effects.",
  "frontend/src/lib/brand.ts": "Exports centralized branding constants including logo path, name, and tagline.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, then renders App.",
  "frontend/src/pages/About.tsx": "Renders the About page with mission details and founder profiles using styled cards and gradients.",
  "frontend/src/pages/Contact.tsx": "Provides contact information, social links, and an inquiry form layout using cards and interactive styling.",
  "frontend/src/pages/Home.tsx": "Implements the landing page with a hero section, CTA buttons, and quick contact cards.",
  "frontend/src/pages/NotFound.tsx": "Displays a 404 error page with navigation options to return home or go back.",
  "frontend/src/pages/Services.tsx": "Shows a list of influencer marketing services with icons, descriptions, and a featured service section.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, custom colors, animations, typography, and plugins.",
  "project_state.json": "Project state describing the Upliftkar website’s structure, branding requirements, known issues, and implemented features."
}